; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v3)
             (pred_5 ?v6 ?v11)
             (pred_4 ?v9 ?v11)
             (pred_2 ?v5 ?v9 )
	     (pred_12 ?v9)
             (pred_8 ?v10)
             (pred_10 ?v6)
             (pred_6 ?v11)
             (pred_3 ?v9)
             (pred_1 ?v6)
             (pred_9 ?v9)
             (pred_7 ))



(:action op_3
:parameters (?v7 ?v8 ?v13 ?v2)
:precondition (and (pred_8 ?v7) (pred_8 ?v8) (pred_10 ?v13) (pred_6 ?v2)
          (pred_11 ?v7 ?v8) (pred_5 ?v13 ?v2)
                   (pred_4 ?v8 ?v2) (pred_12 ?v7) 
                   (pred_3 ?v8) (pred_1 ?v13))
:effect (and  (pred_9 ?v8) (not (pred_3 ?v8))))


(:action op_2
:parameters (?v7 ?v12)
:precondition (and (pred_8 ?v7) (pred_8 ?v12)
               (pred_12 ?v7) (pred_11 ?v7 ?v12) (pred_9 ?v12))
:effect (and (pred_12 ?v12) (not (pred_12 ?v7))))

(:action op_5
:parameters (?v7 ?v13)
:precondition (and (pred_8 ?v7) (pred_10 ?v13) 
                  (pred_12 ?v7) (pred_2 ?v13 ?v7) (pred_7 ))
:effect (and (pred_1 ?v13)
   (not (pred_2 ?v13 ?v7)) (not (pred_7 ))))


(:action op_1
:parameters (?v7 ?v1 ?v4)
:precondition (and (pred_8 ?v7) (pred_10 ?v1) (pred_10 ?v4)
                  (pred_12 ?v7) (pred_1 ?v4) (pred_2 ?v1 ?v7))
:effect (and (pred_1 ?v1) (pred_2 ?v4 ?v7)
        (not (pred_1 ?v4)) (not (pred_2 ?v1 ?v7))))

(:action op_4
:parameters (?v7 ?v13)
:precondition (and (pred_8 ?v7) (pred_10 ?v13) 
                  (pred_12 ?v7) (pred_1 ?v13))
:effect (and (pred_7 ) (pred_2 ?v13 ?v7) (not (pred_1 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_30 obj_23 obj_02 obj_12 obj_09 obj_26 obj_17 obj_07 obj_24 obj_05 obj_06 obj_08 obj_10 obj_14 obj_11 obj_20 obj_16 obj_19 obj_15 obj_25 obj_03 obj_29 obj_31 obj_27 obj_21
    obj_22 obj_04 obj_28
    obj_32 obj_13 obj_18 obj_01
    )

    (:init
       (pred_7)

       (pred_8 obj_30)
       (pred_8 obj_23)
       (pred_8 obj_02)
       (pred_8 obj_12)
       (pred_8 obj_09)
       (pred_8 obj_26)
       (pred_8 obj_17)
       (pred_8 obj_07)
       (pred_8 obj_24)
       (pred_8 obj_05)
       (pred_8 obj_06)
       (pred_8 obj_08)
       (pred_8 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_11)
       (pred_8 obj_20)
       (pred_8 obj_16)
       (pred_8 obj_19)
       (pred_8 obj_15)
       (pred_8 obj_25)
       (pred_8 obj_03)
       (pred_8 obj_29)
       (pred_8 obj_31)
       (pred_8 obj_27)
       (pred_8 obj_21)
       (pred_6 obj_22)
       (pred_6 obj_04)
       (pred_6 obj_28)
       (pred_10 obj_32)
       (pred_10 obj_13)
       (pred_10 obj_18)
       (pred_10 obj_01)

       (pred_11 obj_30 obj_26)
       (pred_11 obj_30 obj_23)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_23 obj_02)
       (pred_11 obj_23 obj_30)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_23)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_09)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_12)
       (pred_11 obj_26 obj_06)
       (pred_11 obj_26 obj_17)
       (pred_11 obj_26 obj_30)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_17 obj_26)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_24)
       (pred_11 obj_07 obj_02)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_24 obj_14)
       (pred_11 obj_24 obj_05)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_24 obj_07)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_24)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_26)
       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_10 obj_14)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_14 obj_24)
       (pred_11 obj_14 obj_10)
       (pred_11 obj_11 obj_25)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_16 obj_29)
       (pred_11 obj_16 obj_19)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_19 obj_31)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_19 obj_16)
       (pred_11 obj_15 obj_27)
       (pred_11 obj_15 obj_25)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_25 obj_11)
       (pred_11 obj_25 obj_15)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_29 obj_31)
       (pred_11 obj_29 obj_16)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_31 obj_27)
       (pred_11 obj_31 obj_19)
       (pred_11 obj_31 obj_29)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_15)
       (pred_11 obj_27 obj_31)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_21 obj_27)
       (pred_3 obj_15)
       (pred_3 obj_14)
       (pred_3 obj_25)
       (pred_3 obj_09)
       (pred_4  obj_15 obj_22)
       (pred_4  obj_14 obj_04)
       (pred_4  obj_25 obj_28)
       (pred_4  obj_09 obj_28)
       (pred_9 obj_30)
       (pred_9 obj_23)
       (pred_9 obj_02)
       (pred_9 obj_12)
       (pred_9 obj_26)
       (pred_9 obj_17)
       (pred_9 obj_07)
       (pred_9 obj_24)
       (pred_9 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_20)
       (pred_9 obj_16)
       (pred_9 obj_19)
       (pred_9 obj_03)
       (pred_9 obj_29)
       (pred_9 obj_31)
       (pred_9 obj_27)
       (pred_9 obj_21)

       (pred_5  obj_32 obj_22)
       (pred_5  obj_13 obj_04)
       (pred_5  obj_18 obj_28)
       (pred_5  obj_01 obj_04)
       (pred_2 obj_32 obj_31)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_18 obj_24)
       (pred_2 obj_01 obj_11)
       (pred_12 obj_24)
    )

    (:goal (and
       (pred_2 obj_13 obj_23)
       (pred_2 obj_01 obj_14)
    ))
(:constraints
  (always (not (pred_12 obj_12)))
)
)

; plan
1. (op_2 obj_24 obj_05)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_05)
   goals met: 0 of 2
2. (op_2 obj_05 obj_11)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_11)
   goals met: 0 of 2
3. (op_5 obj_11 obj_01)
   deleted: (pred_2 obj_01 obj_11) (pred_7)
   added: (pred_1 obj_01)
   goals met: 0 of 2
4. (op_3 obj_11 obj_14 obj_01 obj_04)
   deleted: (pred_3 obj_14)
   added: (pred_9 obj_14)
   goals met: 0 of 2
5. (op_2 obj_11 obj_14)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_14)
   goals met: 0 of 2
6. (op_4 obj_14 obj_01)
   deleted: (pred_1 obj_01)
   added: (pred_7) (pred_2 obj_01 obj_14)
   goals met: 1 of 2
7. (op_2 obj_14 obj_11)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_11)
   goals met: 1 of 2
8. (op_5 obj_11 obj_13)
   deleted: (pred_2 obj_13 obj_11) (pred_7)
   added: (pred_1 obj_13)
   goals met: 1 of 2
9. (op_2 obj_11 obj_05)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_05)
   goals met: 1 of 2
10. (op_2 obj_05 obj_24)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_24)
   goals met: 1 of 2
11. (op_2 obj_24 obj_07)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_07)
   goals met: 1 of 2
12. (op_2 obj_07 obj_02)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_02)
   goals met: 1 of 2
13. (op_2 obj_02 obj_23)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_23)
   goals met: 1 of 2
14. (op_4 obj_23 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_7) (pred_2 obj_13 obj_23)
   goals met: 2 of 2
